mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
                        simpleMed.mag = detect_delta_N * 1000000;
                        simpleMed.deg = detect_delta_S * 1000000;
                        uartSendMed(simpleMed);
                        simpleMed.mag = 0;
                        simpleMed.deg = 0;
                        configOption = ExitConfig;
                        break;
                    case SetEmi:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) emisorSelect = TRANS_EMISOR_NORTE;
                        if (configOption == 2) emisorSelect = TRANS_EMISOR_SUR;
                        if (configOption == 3) emisorSelect = TRANS_EMISOR_ESTE;
                        if (configOption == 4) emisorSelect = TRANS_EMISOR_OESTE;
                        configOption = ExitConfig;
                        break;
                    case SetPeriod:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) MED_PERIOD = 5;
                        if (configOption == 2) MED_PERIOD = 10;
                        if (configOption == 3) MED_PERIOD = 30;
                        if (configOption == 4) MED_PERIOD = 60;
                        if (configOption == 5) MED_PERIOD = 600;
                        configOption = ExitConfig;
                        break;
                    case ExitConfig:
                        anemometroModoActivo = Menu;
                        break;
                    default: anemometroModoActivo = Menu;
                }

                anemometroModoActivo = Menu;
                break;
            default: anemometroModoActivo = Menu;
        }
    }
}

/*CADA 5 SEGUNDOS ENVIARÁ UN TREN DE PULSOS POR UNO DE LOS CANALES*/
//static void transductor_test_task(void *pvParameters) {
//
//    while (1) {
//
//        vTaskDelay(10 / portTICK_PERIOD_MS);
//
//        LED_ON;
//        //CANAL 0
//        muxOutputSelect(TRANS_EMISOR_OESTE);
//
//        comparadorPulseTrain_bloq(TRAIN_PULSE_LENGTH);
//
//        vTaskDelay(5000 / portTICK_PERIOD_MS);
//        //CANAL 1
//        LED_OFF;
//
//        muxOutputSelect(TRANS_EMISOR_ESTE);
//
//        comparadorPulseTrain_bloq(TRAIN_PULSE_LENGTH);
//
//        vTaskDelay(5000 / portTICK_PERIOD_MS);
//        //CANAL 2
//        LED_ON;
//
//        muxOutputSelect(TRANS_EMISOR_NORTE);
//
//        comparadorPulseTrain_bloq(TRAIN_PULSE_LENGTH);
//
//        vTaskDelay(5000 / portTICK_PERIOD_MS);
//        //CANAL 3
//        LED_OFF;
//
//        muxOutputSelect(TRANS_EMISOR_SUR);
//
//        comparadorPulseTrain_bloq(TRAIN_PULSE_LENGTH);
//
//        vTaskDelay(5000 / portTICK_PERIOD_MS);
//    }
//}

//static void led_test_task(void *pvParameters) {
//    uint8_t flag = 0;
//    char str[] = "TEST\r\n";
//    char strRev[10];
//    uint16_t mediciones[1500];
//    uint32_t index = 0;
//
//    while (1) {
//        muxOutputSelect(TRANS_EMISOR_NORTE);
//        vTaskDelay(5 / portTICK_PERIOD_MS);
//        //Prendo 2do mux
//        MUX_INPUT_INH(0);
//        vTaskDelay(5 / portTICK_PERIOD_MS);
//        //adc_start();
//
//        if (flag) {
//            //Apaga led
//            LED_OFF;
//            //Apaga pwm
//            //            MUX_INPUT_INH(0);
//            vTaskDelay(5 / portTICK_PERIOD_MS);
//            //            filtroEnable();
//            //            uartRecv((uint8_t *) strRev, 5, portMAX_DELAY);
//            //comparadorStop();
//            flag = 0;
//        } else {
//            //Prende Led
//            LED_ON;
//            vTaskDelay(5 / portTICK_PERIOD_MS);
//            //            MUX_INPUT_INH(1);
//            //            filtroDisable();
//            //            vTaskDelay(5 / portTICK_PERIOD_MS);
//            //UART
//            //            uartSendMenu(menuTemplate);
//            //            uartSend((uint8_t *) str, 6, portMAX_DELAY);
//            //Arranca pwm
//            //comparadorStart();
//            //            comparadorPulseTrainRTOS(TRAIN_PULSE_LENGTH);
//            //ADC
//            //            adc_start();
//            //            simpleMed = anemometroGetMed();
//            //            DELAY_50uS;
//            //            vTaskDelay(1 / portTICK_PERIOD_MS);
//            //            adc_stop();
//            flag = 1;
//        }
//        vTaskDelay(5000 / portTICK_PERIOD_MS);
//    }
//}

float anemometroGetVcoord(mux_transSelect_enum coordV) {
    float valMed = 0;
    float timeMed[] = {0, 0};
    float timeNmediciones[N_TIMER_MODE];
    uint8_t i = 0;
    uint8_t n = 0;
    float timeCorr[2];

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MODE; n++) {

            timeNmediciones[n] = anemometroGetCoordTime(coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        timeMed[i] = anemometroCalcMode(timeNmediciones, N_TIMER_MODE);
    }

    if (timeMed[0] == 0 || timeMed[1] == 0) {
        valMed = 666.66;
    } else {
        //Calculo 
        switch (coordV) {
            case TRANS_EMISOR_OESTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_O; //taOE
                timeCorr[1] = timeMed[1] - detect_delta_E; //trOE

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }
                //Si los dos tiempos desfasan para el mismo lado la medicion carece de sentido
                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                /*La definicion de las coordenadas es tal que si el viento sopla 
                 * DESDE el NORTE el angulo es 0°
                 *si sopla DESDE el OESTE el angulo es 90°
                 * El angulo va de 0° a 360°
                 */
                valMed = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
                valMed = (valMed - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
                break;
            case TRANS_EMISOR_NORTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_N;
                timeCorr[1] = timeMed[1] - detect_delta_S;

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }

                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                valMed = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
                valMed = (valMed - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
                break;
            default:
                valMed = 444.44;
        }
    }
    return valMed;
}
//float anemometroGetVcoord(mux_transSelect_enum coord) {
//    float valMed = 0;
//    float valAcum = 0;
//    float valProm = 0;
//    uint32_t timeMed[] = {0, 0};
//    uint32_t ulNotificationValue;
//    uint8_t i = 0;
//    uint8_t n = 0;
//    uint8_t nMedProm = N_MED_PROM;
//    float timeConv[2];
//    BaseType_t notifyStatus = pdFAIL;
//
//    for (n = 0; n < N_MED_PROM; n++) {
//        for (i = 0; i < 2; i++) {
//            anemometroEmiterSelect(coord + i);
//
//            DELAY_50uS;
//
//            timerStart();
//
//            comparadorPulseTrain_NObloq(TRAIN_PULSE_LENGTH);
//
//            //Necesitaria esperar 400us
//            DELAY_400uS;
//            DELAY_400uS;
//            anemometroReceptorDelay(coord + i);
//
//            adc_start();
//
//            //        ulNotificationValue = ulTaskNotifyTake(pdTRUE, 1 / portTICK_PERIOD_MS);
//            notifyStatus = xTaskNotifyWait(0, UINT32_MAX, &ulNotificationValue, 1 / portTICK_PERIOD_MS);
//
//            if ((ulNotificationValue & 0x1) != 0 && notifyStatus == pdPASS) {
//                timeMed[i] = timerCount();
//            } else {
//                timeMed[i] = 0;
//            }
//            adc_stop();
//
//            timerStop();
//        }
//
//        if (timeMed[0] == 0 || timeMed[1] == 0) {
//            valMed = 0;
//            nMedProm--;
//        } else {
//            //    Convierto tiempos a us
//            timeConv[0] = timerCount2s(timeMed[0]); // N u O
//            timeConv[1] = timerCount2s(timeMed[1]); // S o E
//
//            //Calculo 
//            switch (coord) {
//                case TRANS_EMISOR_OESTE:
//                    //Corrijo los tiempos medidos
//                    timeConv[0] = timeConv[0] - DETECTION_ERROR_O; //taOE
//                    timeConv[1] = timeConv[1] - DETECTION_ERROR_E; //trOE
//
//                    /*La definicion de las coordenadas es tal que si el viento sopla 
//                     * DESDE el NORTE el angulo es 0°
//                     *si sopla DESDE el OESTE el angulo es 90°
//                     * El angulo va de 0° a 360°
//                     */
//                    valMed = (((float) DISTANCE_EO / 2) * (1 / timeConv[0] - 1 / timeConv[1])) - OFFSET_ERROR_EO;
//                    break;
//                case TRANS_EMISOR_NORTE:
//                    //Corrijo los tiempos medidos
//                    timeConv[0] = timeConv[0] - DETECTION_ERROR_N;
//                    timeConv[1] = timeConv[1] - DETECTION_ERROR_S;
//
//                    valMed = (((float) DISTANCE_NS / 2) * (1 / timeConv[0] - 1 / timeConv[1])) - OFFSET_ERROR_NS;
//                    break;
//                default:
//                    nMedProm--;
//                    valMed = 0;
//            }
//            valAcum += valMed;
//        }
//        vTaskDelay(1 / portTICK_PERIOD_MS);
//
//    }
//    if (nMedProm > 0) {
//        valProm = valAcum / nMedProm;
//    } else {
//        valProm = 999.99;
//    }
//
//    return valProm;
//    //    return valMed;
//}

//float anemometroGetMedProm(mux_transSelect_enum coordProm, uint8_t prom) {
//    float medAcum = 0;
//    uint8_t medNprom = prom;
//    uint8_t i = 0;
//    float medCoord = 0;
//
//    for (i = 0; i < prom; i++) {
//        medCoord = anemometroGetVcoord(coordProm);
//        if (medCoord < 100) {
//            medAcum += medCoord;
//        } else {
//            medNprom--;
//        }
//    }
//
//    if (medNprom > (prom / 2)) {
//        return medAcum / medNprom;
//    } else {
//        return 666.66;
//    }
//}

